
import logging
from certificates.certificates_server import CertificateServer
logging.basicConfig(
    level=logging.INFO,
    format="%(asctime)s - %(levelname)s - %(message)s"
)
class nieTTS:
    def __init__(self):
        pass
if __name__ == '__main__':
    tts = nieTTS()
    logging.info(f"""
        ███╗   ██╗  ██╗  ███████╗  ████████╗  ████████╗  ███████╗
        ████╗  ██║  ██║  ██╔════╝  ╚══██╔══╝  ╚══██╔══╝  ██╔════╝
        ██╔██╗ ██║  ██║  █████╗       ██║        ██║     ███████╗
        ██║╚██╗██║  ██║  ██╔══╝       ██║        ██║     ╚════██║
        ██║ ╚████║  ██║  ███████╗     ██║        ██║     ███████║
        ╚═╝  ╚═══╝  ╚═╝  ╚══════╝     ╚═╝        ╚═╝     ╚══════╝
        """)
    cert_server = CertificateServer()
    logging.info(f"自签名证书已生成，IP地址: {cert_server.ip_address}")